content/index.org
#+title: Cours & exercices de Python
#+language: fr
#+author: Bastien ZALUGAS
#+HTML_DOCTYPE: html5
#+options: <:nil ^:{} broken-links:mark creator:nil date:nil email:nil timestamp:nil toc:2 html-style:nil num:nil html5-fancy:t author:nil
#+setupfile: theme/personal/personal-theme.setup

* Introduction
:PROPERTIES:
:custom_id: introduction
:END:
*** Présentation
- Prénom
- As-tu déjà programmé ? Si oui, avec quel langage de programmation ?
- Motivation : pourquoi t'es-tu inscrit à ce cours ?
*** Notions de base
- Ordinateur ?
- Programmation ?
- Programme ?
- Langage de programmation ?
- Instruction ?
- Compilation ?
- Exécution ?
- Syntaxe ?
*** Pourquoi Python ?
- Langage interprété : versatilité (le fonctionnement ne dépend pas du système d'exploitation)
- Syntaxe simple
- Très utilisé dans pleins de domaines différents
*** Introduction à IDLE
- Sauvegarder un programme
- Premier programme : Hello World !

* Chapitre 1 : Calculs et variables
:properties:
:custom_id: chapitre1
:end:
** Cours 1 : Opérateurs arithmétiques
:PROPERTIES:
:custom_id: chapitre1_cours1
:END:
*** Manuel
- *"Calculer avec Python"*, p.22
- *"Les opérateurs de Python"*, p.23
- *"L'ordre des opérateurs"*, p.24
*** Exercices
1. Dans un programme nommé ~cours1.py~ :
   - Affiche le résultat d'une *addition*.
   - Affiche le résultat d'une *soustraction*.
   - Affiche le résultat d'une *multiplication*.
   - Affiche le résultat d'une *division*.
   - Affiche le résultat d'un calcul utilisant *tous les opérateurs*.
   - Affiche les résultats de *deux calculs contenant les mêmes valeurs et opérateurs* mais avec et sans *parenthèses*, pour illustrer l'ordre des opérateurs et le fonctionnement des parenthèses.

** Cours 2 : Variables
:PROPERTIES:
:custom_id: chapitre1_cours2
:END:
*** Manuel
- *"Les variables sont comme des étiquettes"*, p.25
- *"Utiliser les variables"*, p.26
*** Exercices
1. Dans un programme nommé =variables.py= :
   - Crée une variable nommée =mon_age= égale à ton âge, puis afficher le contenu de cette variable.
   - Crée une variable nommée =annee_actuelle= égale à l'année actuelle.
   - Affiche le résultat de =annee_actuelle= moins =mon_age=.

* Chapitre 2 : Chaînes, listes, tuples, dictionnaires
:PROPERTIES:
:custom_id: chapitre2
:END:
** Cours 3 : Chaînes de caractères 1
:PROPERTIES:
:custom_id: chapitre2_cours3
:END:
*** Manuel
- *"Les chaînes"*, p.32
- *"Créer des chaînes"*, p.32
- *"Gérer les problèmes de chaînes"*, p.33
*** Exercices
1. Dans un programme nommé =prenom_nom.py= :
   - Crée une variable =prenom= contenant une chaîne de caractères correspondant à ton prénom.
   - Crée une variable =nom= contenant une chaîne de caractères correspondant à ton nom de famille.
   - Affiche *"Bonjour ! Je m'appelle "* suivi du contenu de =prenom=, puis d'un espace, puis du contenu de =nom=.

2. Dans un programme nommé =multiligne.py= :
   - Crée une variable =ma_journee= contenant une chaîne de caractères de plusieurs lignes racontant ta journée.
   - Affiche =ma_journee=.

3. Dans un programme nommé =guillemets.py= :
   - Crée une variable =guillemets= qui contient la phrase *C'est vraiment compliqué de dire "mon prof de python est le meilleur" sans provoquer d'erreur.*.
   - Affiche cette variable.

** Cours 4 : Chaînes de caractères 2
:PROPERTIES:
:custom_id: chapitre2_cours4
:END:
*** Manuel
- *"Insérer des valeurs dans des chaînes"*, p.36
- *"Multiplier des chaînes"*, p.37
*** Exercices
1. Dans un programme nommé =prenom_nom_mieux.py= :
   - Crée une variable =prenom= contenant une chaîne de caractères correspondant à ton prénom.
   - Crée une variable =nom= contenant une chaîne de caractères correspondant à ton nom de famille.
   - Affiche "Bonjour ! Je m'appelle <prénom> <nom>" en remplaçant <prénom> et <nom> par les variables créées plus tôt et en utilisant une seule instruction =print()=. (Ne pas oublier les espaces !).

2. Dans un programme nommé =mon_salaire.py= :
   - Crée une variable =pieces_par_jour= contenant le nombre de pièces d'or que tu gagnes par jour.
   - Crée une variable =jours_de_travail= contenant le nombre de jours où tu as travaillé.
   - Affiche *"En travaillant <jours_de_travail> et avec un salaire quotidien de <pieces_par_jour>, j'ai gagné un total de <jours_de_travail * pieces_par_jour>. Je pourrai bientôt acheter mon collège !"* en n'utilisant qu'une seule instruction =print()=. Il faudra bien sûr remplacer les parties entre chevrons (<...>) par le contenu des variables.

3. Dans un programme nommé =mes_anniversaires.py= :
   - Crée une variable =phrase= contenant la phrase "Joyeux anniversaire !".
   - Crée une variable =age= contenant ton âge
   - Affiche *"Voici un résumé de tous mes anniversaires : "*.
   - Affiche la phrase d'anniversaire autant de fois que ton âge.

** Cours 5 : Listes 1
:PROPERTIES:
:custom_id: chapitre2_cours5
:END:
*** Manuel
- *"Plus puissantes que les chaînes : les listes"*, p.38
