public/index.html
<!DOCTYPE html>
<html lang="fr">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Cours &amp; exercices de Python</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="theme/personal/src/personalStyle.css"/>
<link rel="stylesheet" href="theme/personal/src/highlight/styles/monokai-sublime.min.css"/>
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">Cours &amp; exercices de Python</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table des matières</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#introduction">Introduction</a></li>
<li><a href="#chapitre1">Chapitre 1 : Calculs et variables</a>
<ul>
<li><a href="#chapitre1_cours1">Cours 1 : Opérateurs arithmétiques</a></li>
<li><a href="#chapitre1_cours2">Cours 2 : Variables</a></li>
</ul>
</li>
<li><a href="#chapitre2">Chapitre 2 : Chaînes, listes, tuples, dictionnaires</a>
<ul>
<li><a href="#chapitre2_cours3">Cours 3 : Chaînes de caractères 1</a></li>
<li><a href="#chapitre2_cours4">Cours 4 : Chaînes de caractères 2</a></li>
<li><a href="#chapitre2_cours5">Cours 5 : Listes 1</a></li>
<li><a href="#chapitre2_cours6">Cours 6 : Listes 2</a></li>
<li><a href="#chapitre2_cours7">Cours 7 : Tuples et dictionnaires</a></li>
<li><a href="#chapitre2_cours8">Cours 8 : Input</a></li>
</ul>
</li>
<li><a href="#chapitre3">Chapitre 3 : Turtle</a></li>
<li><a href="#chapitre4">Chapitre 4 : Les conditions</a></li>
<li><a href="#chapitre5">Chapitre 5 : Les boucles</a></li>
<li><a href="#chapitre6">Chapitre 6 : Mise en pratique</a></li>
<li><a href="#chapitre7">Chapitre 7 : Les fonctions</a></li>
<li><a href="#chapitre8">Chapitre 8 : Regroupons tout !</a></li>
</ul>
</div>
</nav>

<div id="outline-container-introduction" class="outline-2">
<h2 id="introduction">Introduction</h2>
<div class="outline-text-2" id="text-introduction">
</div>
<div id="outline-container-org08e63bf" class="outline-4">
<h4 id="org08e63bf">Présentation</h4>
<div class="outline-text-4" id="text-org08e63bf">
<ul class="org-ul">
<li>Prénom</li>
<li>As-tu déjà programmé ? Si oui, avec quel langage de programmation ?</li>
<li>Motivation : pourquoi t'es-tu inscrit à ce cours ?</li>
</ul>
</div>
</div>
<div id="outline-container-orgf80b36e" class="outline-4">
<h4 id="orgf80b36e">Notions de base</h4>
<div class="outline-text-4" id="text-orgf80b36e">
<ul class="org-ul">
<li>Ordinateur ?</li>
<li>Programmation ?</li>
<li>Programme ?</li>
<li>Langage de programmation ?</li>
<li>Instruction ?</li>
<li>Compilation ?</li>
<li>Exécution ?</li>
<li>Syntaxe ?</li>
</ul>
</div>
</div>
<div id="outline-container-org6cb4a95" class="outline-4">
<h4 id="org6cb4a95">Pourquoi Python ?</h4>
<div class="outline-text-4" id="text-org6cb4a95">
<ul class="org-ul">
<li>Langage interprété : versatilité (le fonctionnement ne dépend pas du système d'exploitation)</li>
<li>Syntaxe simple</li>
<li>Très utilisé dans pleins de domaines différents</li>
</ul>
</div>
</div>
<div id="outline-container-org0b9f4a6" class="outline-4">
<h4 id="org0b9f4a6">Introduction à IDLE</h4>
<div class="outline-text-4" id="text-org0b9f4a6">
<ul class="org-ul">
<li>Sauvegarder un programme</li>
<li>Premier programme : Hello World !</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-chapitre1" class="outline-2">
<h2 id="chapitre1">Chapitre 1 : Calculs et variables</h2>
<div class="outline-text-2" id="text-chapitre1">
</div>
<div id="outline-container-chapitre1_cours1" class="outline-3">
<h3 id="chapitre1_cours1">Cours 1 : Opérateurs arithmétiques</h3>
<div class="outline-text-3" id="text-chapitre1_cours1">
</div>
<div id="outline-container-org4dde6d7" class="outline-4">
<h4 id="org4dde6d7">Manuel</h4>
<div class="outline-text-4" id="text-org4dde6d7">
<ul class="org-ul">
<li><b>"Calculer avec Python"</b>, p.22</li>
<li><b>"Les opérateurs de Python"</b>, p.23</li>
<li><b>"L'ordre des opérateurs"</b>, p.24</li>
</ul>
</div>
</div>
<div id="outline-container-org5ef4e71" class="outline-4">
<h4 id="org5ef4e71">Exercices</h4>
<div class="outline-text-4" id="text-org5ef4e71">
<ol class="org-ol">
<li>Dans un programme nommé <code>cours1.py</code> :
<ul class="org-ul">
<li>Affiche le résultat d'une <b>addition</b>.</li>
<li>Affiche le résultat d'une <b>soustraction</b>.</li>
<li>Affiche le résultat d'une <b>multiplication</b>.</li>
<li>Affiche le résultat d'une <b>division</b>.</li>
<li>Affiche le résultat d'un calcul utilisant <b>tous les opérateurs</b>.</li>
<li>Affiche les résultats de <b>deux calculs contenant les mêmes valeurs et opérateurs</b> mais avec et sans <b>parenthèses</b>, pour illustrer l'ordre des opérateurs et le fonctionnement des parenthèses.</li>
</ul></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-chapitre1_cours2" class="outline-3">
<h3 id="chapitre1_cours2">Cours 2 : Variables</h3>
<div class="outline-text-3" id="text-chapitre1_cours2">
</div>
<div id="outline-container-orgfbbace0" class="outline-4">
<h4 id="orgfbbace0">Manuel</h4>
<div class="outline-text-4" id="text-orgfbbace0">
<ul class="org-ul">
<li><b>"Les variables sont comme des étiquettes"</b>, p.25</li>
<li><b>"Utiliser les variables"</b>, p.26</li>
</ul>
</div>
</div>
<div id="outline-container-orgcf93133" class="outline-4">
<h4 id="orgcf93133">Exercices</h4>
<div class="outline-text-4" id="text-orgcf93133">
<ol class="org-ol">
<li>Dans un programme nommé <code>variables.py</code> :
<ul class="org-ul">
<li>Crée une variable nommée <code>mon_age</code> égale à ton âge, puis afficher le contenu de cette variable.</li>
<li>Crée une variable nommée <code>annee_actuelle</code> égale à l'année actuelle.</li>
<li>Affiche le résultat de <code>annee_actuelle</code> moins <code>mon_age</code>.</li>
</ul></li>
</ol>
</div>
</div>
</div>
</div>

<div id="outline-container-chapitre2" class="outline-2">
<h2 id="chapitre2">Chapitre 2 : Chaînes, listes, tuples, dictionnaires</h2>
<div class="outline-text-2" id="text-chapitre2">
</div>
<div id="outline-container-chapitre2_cours3" class="outline-3">
<h3 id="chapitre2_cours3">Cours 3 : Chaînes de caractères 1</h3>
<div class="outline-text-3" id="text-chapitre2_cours3">
</div>
<div id="outline-container-orge04d754" class="outline-4">
<h4 id="orge04d754">Manuel</h4>
<div class="outline-text-4" id="text-orge04d754">
<ul class="org-ul">
<li><b>"Les chaînes"</b>, p.32</li>
<li><b>"Créer des chaînes"</b>, p.32</li>
<li><b>"Gérer les problèmes de chaînes"</b>, p.33</li>
</ul>
</div>
</div>
<div id="outline-container-org40ed078" class="outline-4">
<h4 id="org40ed078">Exercices</h4>
<div class="outline-text-4" id="text-org40ed078">
<ol class="org-ol">
<li>Dans un programme nommé <code>prenom_nom.py</code> :
<ul class="org-ul">
<li>Crée une variable <code>prenom</code> contenant une chaîne de caractères correspondant à ton prénom.</li>
<li>Crée une variable <code>nom</code> contenant une chaîne de caractères correspondant à ton nom de famille.</li>
<li>Affiche <b>"Bonjour ! Je m'appelle "</b> suivi du contenu de <code>prenom</code>, puis d'un espace, puis du contenu de <code>nom</code>.</li>
</ul></li>

<li>Dans un programme nommé <code>multiligne.py</code> :
<ul class="org-ul">
<li>Crée une variable <code>ma_journee</code> contenant une chaîne de caractères de plusieurs lignes racontant ta journée.</li>
<li>Affiche <code>ma_journee</code>.</li>
</ul></li>

<li>Dans un programme nommé <code>guillemets.py</code> :
<ul class="org-ul">
<li>Crée une variable <code>guillemets</code> qui contient la phrase <b>C'est vraiment compliqué de dire "mon prof de python est le meilleur" sans provoquer d'erreur.</b>.</li>
<li>Affiche cette variable.</li>
</ul></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-chapitre2_cours4" class="outline-3">
<h3 id="chapitre2_cours4">Cours 4 : Chaînes de caractères 2</h3>
<div class="outline-text-3" id="text-chapitre2_cours4">
</div>
<div id="outline-container-orgf634cbd" class="outline-4">
<h4 id="orgf634cbd">Manuel</h4>
<div class="outline-text-4" id="text-orgf634cbd">
<ul class="org-ul">
<li><b>"Insérer des valeurs dans des chaînes"</b>, p.36</li>
<li><b>"Multiplier des chaînes"</b>, p.37</li>
</ul>
</div>
</div>
<div id="outline-container-org64cb5fd" class="outline-4">
<h4 id="org64cb5fd">Exercices</h4>
<div class="outline-text-4" id="text-org64cb5fd">
<ol class="org-ol">
<li>Dans un programme nommé <code>prenom_nom_mieux.py</code> :
<ul class="org-ul">
<li>Crée une variable <code>prenom</code> contenant une chaîne de caractères correspondant à ton prénom.</li>
<li>Crée une variable <code>nom</code> contenant une chaîne de caractères correspondant à ton nom de famille.</li>
<li>Affiche "Bonjour ! Je m'appelle &lt;prénom&gt; &lt;nom&gt;" en remplaçant &lt;prénom&gt; et &lt;nom&gt; par les variables créées plus tôt et en utilisant une seule instruction <code>print()</code>. (Ne pas oublier les espaces !).</li>
</ul></li>

<li>Dans un programme nommé <code>mon_salaire.py</code> :
<ul class="org-ul">
<li>Crée une variable <code>pieces_par_jour</code> contenant le nombre de pièces d'or que tu gagnes par jour.</li>
<li>Crée une variable <code>jours_de_travail</code> contenant le nombre de jours où tu as travaillé.</li>
<li>Affiche <b>"En travaillant &lt;jours_de_travail&gt; et avec un salaire quotidien de &lt;pieces_par_jour&gt;, j'ai gagné un total de &lt;jours_de_travail * pieces_par_jour&gt;. Je pourrai bientôt acheter mon collège !"</b> en n'utilisant qu'une seule instruction <code>print()</code>. Il faudra bien sûr remplacer les parties entre chevrons (&lt;&#x2026;&gt;) par le contenu des variables.</li>
</ul></li>

<li>Dans un programme nommé <code>mes_anniversaires.py</code> :
<ul class="org-ul">
<li>Crée une variable <code>phrase</code> contenant la phrase "Joyeux anniversaire !".</li>
<li>Crée une variable <code>age</code> contenant ton âge</li>
<li>Affiche <b>"Voici un résumé de tous mes anniversaires : "</b>.</li>
<li>Affiche la phrase d'anniversaire autant de fois que ton âge.</li>
</ul></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-chapitre2_cours5" class="outline-3">
<h3 id="chapitre2_cours5">Cours 5 : Listes 1</h3>
<div class="outline-text-3" id="text-chapitre2_cours5">
</div>
<div id="outline-container-org3fe01f4" class="outline-4">
<h4 id="org3fe01f4">Manuel</h4>
<div class="outline-text-4" id="text-org3fe01f4">
<ul class="org-ul">
<li><b>"Plus puissantes que les chaînes : les listes"</b>, p.38</li>
</ul>
</div>
</div>
