content/index.org
*** Exercices
1. Dans un programme nommé =liste_courses.py= :
   - Crée une variable =courses= contenant une liste d'au moins 5 choses à acheter. Chaque élément sera une chaîne de caractères.
   - Affiche la liste de courses.
   - Affiche le 1^{er} élément de la liste en utilisant son indice.
   - Affiche le 3^{ème} élément de la liste en utilisant son indice.
   - Modifie le 2^{ème} élément de la liste et l'afficher après modification.
   - Modifie le dernier élément de la liste et l'afficher après modification.
   - Affiche d'un seul coup le sous-ensemble de la liste contenant les 2^{ème}, 3^{ème} et 4^{ème} éléments de la liste.

2. Dans un programme nommé =liste_courses_quantite.py= :
   - Crée une variable =courses_quantite= contenant au moins 5 chiffres qui correspondent à des quantités d'éléments à acheter. Chaque chiffre sera suivi d'une chaîne de caractères correspondant à un élément.
   - Affiche =courses_quantite=.
   - Affiche le sous-ensemble contenant les 3^{ème} et 4^{ème} éléments de la liste.

3. Dans un programme nommé =liste_ultime.py= :
   - Crée une variable =courses= contenant une liste d'au moins 5 éléments à acheter. Tu peux réutiliser les éléments précédents.
   - Crée une variable =quantites=  contenant une liste d'autant de nombres qu'il y a d'éléments dans la liste de courses. Chaque nombre correspondra à la quantité d'éléments à acheter. Tu peux réutiliser les nombres précédents.
   - Crée une variable =liste_courses= contenant les deux listes.
   - Affiche =liste_courses=.
   - Affiche *"Je dois acheter <quantite> <element> au supermarché."*. <quantite> et <element> doivent correspondre au deuxième élément de chaque liste contenue dans =liste_courses=.

** Cours 6 : Listes 2
:PROPERTIES:
:custom_id: chapitre2_cours6
:END:
*** Manuel
- *"Ajouter des éléments à une liste"*, p.41
- *"Supprimer des éléments à une liste"*, p.42
- *"Arithmétique de liste"*, p.42
*** Exercices
1. Dans un programme nommé =liste_eleves.py= :
   - Crée une variable =eleves= contenant la liste des prénoms des personnes présentes à l'atelier Python en omettant le tient.
   - Affiche la liste.
   - Ajoute ton prénom et celui du professeur dans la liste.
   - Affiche la liste modifiée.
   - Supprime le prénom du professeur.
   - Place ton prénom au début de la liste.
   - Affiche la liste finale.

2. Dans un programme nommé =encore_plus_de_listes.py= :
   - Crée une liste =liste_1= avec au moins 3 éléments de ton choix.
   - Crée une liste =liste_2= avec au moins 2 élements de ton choix.
   - Crée une liste =des_listes= qui est la concaténation des deux autres.
   - Affiche la liste =des_listes=.
   - Fais en sorte que la liste =des_listes= ait 5 fois plus de contenu.
   - Affiche la liste =des_listes=.

** Cours 7 : Tuples et dictionnaires
:PROPERTIES:
:custom_id: chapitre2_cours7
:END:
*** Manuel
- *"Tuples"*, p.45
- *"Dictionnaires"*, p.45
*** Exercices
1. Dans un programme nommé =tuple.py= :
   - Crée un tuple =un_tuple= avec au moins 3 éléments.
   - Affiche le tuple.
   - Modifie la première valeur du tuple.
   - Affiche le tuple modifié.

2. Dans un programme nommé =courses_dictionnaire.py= :
   - Crée un dictionnaire =courses= contenant 3 éléments à acheter comme clé avec comme valeur la quantité à acheter.
   - Affiche le dictionnaire.
   - Ajoute un élément que tu aurais oublié.
   - Supprime le premier élément du dictionnaire.
   - Modifie la deuxième entrée du dictionnaire.
   - Affiche le dictionnaire.

** Cours 8 : Input
:PROPERTIES:
:custom_id: chapitre2_cours8
:END:
*** Cours
Jusqu'ici, nous avons donné à nos variables des valeurs directement dans le code python. Comment fait-on si l'on souhaite poser une question à l'utilisateur sans qu'il ait besoin de modifier le code ?

La méthode la plus simple, c'est d'utiliser la fonction =input()=. Nous utilisons déjà la fonction =print()= pour afficher du texte à l'écran mais nous verrons plus tard et en détail ce qu'est une fonction en programmation.

En anglais, "input" signifie "entrée". La fonction =input()= sert à récupérer une "entrée utilisateur", c'est-à-dire les informations que l'utilisateur (celui qui utilise le programme) donne à l'ordinateur. Pour le moment, les informations seront seulement des caractères que l'utilisateur tapera au clavier. Lorsque nous utiliserons =input()=, l'utilisateur pourra entrer des caractères au clavier et terminer par la touche <Enter> ou <Entrée> pour terminer. Dans le programme, nous pourrons récupérer ce que l'utilisateur a entré dans une variable pour le réutiliser.

On peut utiliser la fonction =input()= en laissant les parenthèses vides. On peut aussi y placer un message explicatif destiné à l'utilisateur. Par exemple :
#+begin_src python
prenom = input("Entrez votre prénom : ")
print("Bonjour %s !" % prenom)
#+end_src

La variable dans laquelle nous récupérons l'entrée utilisateur sera une chaîne de caractères. Si nous essayons de faire des opérations arithmétiques avec la valeur récupérée, cela va générer une erreur "TypeError":
#+begin_src python
age = input("Entrez votre âge : ")
print(age + 10)
#+end_src
Résultat :
#+begin_src bash
TypeError: can only concatenate str (not "int") to str
#+end_src

Ou encore :
#+begin_src python
age = input("Entrez votre âge : ")
print("Tu es né en %s !" % (2022 - age))
#+end_src
Résultat :
#+begin_src bash
TypeError: unsupported operand type(s) for -: 'int' and 'str'
#+end_src

Python génère une erreur car la variable =age= est une chaîne de caractères et non pas un nombre avec lequel on peut faire une opération. Pour résoudre ce problème, il nous suffit de convertir la valeur de retour de =input()= en nombre. Si nous voulons un nombre entier (sans virgule), il faut utiliser =int()=. Si nous souhaitons récupérer un nombre décimal (à virgule), nous devons utiliser =float()=.
Exemple pour convertir en un nombre entier :
#+begin_src python
age = int(input("Entrez votre âge : "))
print("Tu es né en %s !" % (2022 - age))
#+end_src

Pour le moment, cela suffira pour créer des programmes plus intéractifs, mais nous reverrons plus en détail les conversions en python dans le chapitre 4.
