public/index.html
<div id="outline-container-org347a039" class="outline-4">
<h4 id="org347a039">Exercices</h4>
<div class="outline-text-4" id="text-org347a039">
<ol class="org-ol">
<li>Dans un programme nommé <code>liste_courses.py</code> :
<ul class="org-ul">
<li>Crée une variable <code>courses</code> contenant une liste d'au moins 5 choses à acheter. Chaque élément sera une chaîne de caractères.</li>
<li>Affiche la liste de courses.</li>
<li>Affiche le 1<sup>er</sup> élément de la liste en utilisant son indice.</li>
<li>Affiche le 3<sup>ème</sup> élément de la liste en utilisant son indice.</li>
<li>Modifie le 2<sup>ème</sup> élément de la liste et l'afficher après modification.</li>
<li>Modifie le dernier élément de la liste et l'afficher après modification.</li>
<li>Affiche d'un seul coup le sous-ensemble de la liste contenant les 2<sup>ème</sup>, 3<sup>ème</sup> et 4<sup>ème</sup> éléments de la liste.</li>
</ul></li>

<li>Dans un programme nommé <code>liste_courses_quantite.py</code> :
<ul class="org-ul">
<li>Crée une variable <code>courses_quantite</code> contenant au moins 5 chiffres qui correspondent à des quantités d'éléments à acheter. Chaque chiffre sera suivi d'une chaîne de caractères correspondant à un élément.</li>
<li>Affiche <code>courses_quantite</code>.</li>
<li>Affiche le sous-ensemble contenant les 3<sup>ème</sup> et 4<sup>ème</sup> éléments de la liste.</li>
</ul></li>

<li>Dans un programme nommé <code>liste_ultime.py</code> :
<ul class="org-ul">
<li>Crée une variable <code>courses</code> contenant une liste d'au moins 5 éléments à acheter. Tu peux réutiliser les éléments précédents.</li>
<li>Crée une variable <code>quantites</code>  contenant une liste d'autant de nombres qu'il y a d'éléments dans la liste de courses. Chaque nombre correspondra à la quantité d'éléments à acheter. Tu peux réutiliser les nombres précédents.</li>
<li>Crée une variable <code>liste_courses</code> contenant les deux listes.</li>
<li>Affiche <code>liste_courses</code>.</li>
<li>Affiche <b>"Je dois acheter &lt;quantite&gt; &lt;element&gt; au supermarché."</b>. &lt;quantite&gt; et &lt;element&gt; doivent correspondre au deuxième élément de chaque liste contenue dans <code>liste_courses</code>.</li>
</ul></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-chapitre2_cours6" class="outline-3">
<h3 id="chapitre2_cours6">Cours 6 : Listes 2</h3>
<div class="outline-text-3" id="text-chapitre2_cours6">
</div>
<div id="outline-container-orga0f4ba6" class="outline-4">
<h4 id="orga0f4ba6">Manuel</h4>
<div class="outline-text-4" id="text-orga0f4ba6">
<ul class="org-ul">
<li><b>"Ajouter des éléments à une liste"</b>, p.41</li>
<li><b>"Supprimer des éléments à une liste"</b>, p.42</li>
<li><b>"Arithmétique de liste"</b>, p.42</li>
</ul>
</div>
</div>
<div id="outline-container-org6df741e" class="outline-4">
<h4 id="org6df741e">Exercices</h4>
<div class="outline-text-4" id="text-org6df741e">
<ol class="org-ol">
<li>Dans un programme nommé <code>liste_eleves.py</code> :
<ul class="org-ul">
<li>Crée une variable <code>eleves</code> contenant la liste des prénoms des personnes présentes à l'atelier Python en omettant le tient.</li>
<li>Affiche la liste.</li>
<li>Ajoute ton prénom et celui du professeur dans la liste.</li>
<li>Affiche la liste modifiée.</li>
<li>Supprime le prénom du professeur.</li>
<li>Place ton prénom au début de la liste.</li>
<li>Affiche la liste finale.</li>
</ul></li>

<li>Dans un programme nommé <code>encore_plus_de_listes.py</code> :
<ul class="org-ul">
<li>Crée une liste <code>liste_1</code> avec au moins 3 éléments de ton choix.</li>
<li>Crée une liste <code>liste_2</code> avec au moins 2 élements de ton choix.</li>
<li>Crée une liste <code>des_listes</code> qui est la concaténation des deux autres.</li>
<li>Affiche la liste <code>des_listes</code>.</li>
<li>Fais en sorte que la liste <code>des_listes</code> ait 5 fois plus de contenu.</li>
<li>Affiche la liste <code>des_listes</code>.</li>
</ul></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-chapitre2_cours7" class="outline-3">
<h3 id="chapitre2_cours7">Cours 7 : Tuples et dictionnaires</h3>
<div class="outline-text-3" id="text-chapitre2_cours7">
</div>
<div id="outline-container-orge17bd47" class="outline-4">
<h4 id="orge17bd47">Manuel</h4>
<div class="outline-text-4" id="text-orge17bd47">
<ul class="org-ul">
<li><b>"Tuples"</b>, p.45</li>
<li><b>"Dictionnaires"</b>, p.45</li>
</ul>
</div>
</div>
<div id="outline-container-orgfc09814" class="outline-4">
<h4 id="orgfc09814">Exercices</h4>
<div class="outline-text-4" id="text-orgfc09814">
<ol class="org-ol">
<li>Dans un programme nommé <code>tuple.py</code> :
<ul class="org-ul">
<li>Crée un tuple <code>un_tuple</code> avec au moins 3 éléments.</li>
<li>Affiche le tuple.</li>
<li>Modifie la première valeur du tuple.</li>
<li>Affiche le tuple modifié.</li>
</ul></li>

<li>Dans un programme nommé <code>courses_dictionnaire.py</code> :
<ul class="org-ul">
<li>Crée un dictionnaire <code>courses</code> contenant 3 éléments à acheter comme clé avec comme valeur la quantité à acheter.</li>
<li>Affiche le dictionnaire.</li>
<li>Ajoute un élément que tu aurais oublié.</li>
<li>Supprime le premier élément du dictionnaire.</li>
<li>Modifie la deuxième entrée du dictionnaire.</li>
<li>Affiche le dictionnaire.</li>
</ul></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-chapitre2_cours8" class="outline-3">
<h3 id="chapitre2_cours8">Cours 8 : Input</h3>
<div class="outline-text-3" id="text-chapitre2_cours8">
</div>
<div id="outline-container-org3b59d66" class="outline-4">
<h4 id="org3b59d66">Cours</h4>
<div class="outline-text-4" id="text-org3b59d66">
<p>
Jusqu'ici, nous avons donné à nos variables des valeurs directement dans le code python. Comment fait-on si l'on souhaite poser une question à l'utilisateur sans qu'il ait besoin de modifier le code ?
</p>

<p>
La méthode la plus simple, c'est d'utiliser la fonction <code>input()</code>. Nous utilisons déjà la fonction <code>print()</code> pour afficher du texte à l'écran mais nous verrons plus tard et en détail ce qu'est une fonction en programmation.
</p>

<p>
En anglais, "input" signifie "entrée". La fonction <code>input()</code> sert à récupérer une "entrée utilisateur", c'est-à-dire les informations que l'utilisateur (celui qui utilise le programme) donne à l'ordinateur. Pour le moment, les informations seront seulement des caractères que l'utilisateur tapera au clavier. Lorsque nous utiliserons <code>input()</code>, l'utilisateur pourra entrer des caractères au clavier et terminer par la touche &lt;Enter&gt; ou &lt;Entrée&gt; pour terminer. Dans le programme, nous pourrons récupérer ce que l'utilisateur a entré dans une variable pour le réutiliser.
</p>

<p>
On peut utiliser la fonction <code>input()</code> en laissant les parenthèses vides. On peut aussi y placer un message explicatif destiné à l'utilisateur. Par exemple :
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">prenom</span> = <span style="font-weight: bold;">input</span>(<span style="font-style: italic;">"Entrez votre pr&#233;nom : "</span>)
<span style="font-weight: bold;">print</span>(<span style="font-style: italic;">"Bonjour %s !"</span> % prenom)
</pre>
</div>

<p>
La variable dans laquelle nous récupérons l'entrée utilisateur sera une chaîne de caractères. Si nous essayons de faire des opérations arithmétiques avec la valeur récupérée, cela va générer une erreur "TypeError":
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">age</span> = <span style="font-weight: bold;">input</span>(<span style="font-style: italic;">"Entrez votre &#226;ge : "</span>)
<span style="font-weight: bold;">print</span>(age + 10)
</pre>
</div>
<p>
Résultat :
</p>
<div class="org-src-container">
<pre class="src src-bash">TypeError: can only concatenate str (not <span style="font-style: italic;">"int"</span>) to str
</pre>
</div>

<p>
Ou encore :
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">age</span> = <span style="font-weight: bold;">input</span>(<span style="font-style: italic;">"Entrez votre &#226;ge : "</span>)
<span style="font-weight: bold;">print</span>(<span style="font-style: italic;">"Tu es n&#233; en %s !"</span> % (2022 - age))
</pre>
</div>
<p>
Résultat :
</p>
<div class="org-src-container">
<pre class="src src-bash">TypeError: unsupported operand type(s) <span style="font-weight: bold;">for</span> -: <span style="font-style: italic;">'int'</span> and <span style="font-style: italic;">'str'</span>
</pre>
</div>

<p>
Python génère une erreur car la variable <code>age</code> est une chaîne de caractères et non pas un nombre avec lequel on peut faire une opération. Pour résoudre ce problème, il nous suffit de convertir la valeur de retour de <code>input()</code> en nombre. Si nous voulons un nombre entier (sans virgule), il faut utiliser <code>int()</code>. Si nous souhaitons récupérer un nombre décimal (à virgule), nous devons utiliser <code>float()</code>.
Exemple pour convertir en un nombre entier :
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">age</span> = <span style="font-weight: bold;">int</span>(<span style="font-weight: bold;">input</span>(<span style="font-style: italic;">"Entrez votre &#226;ge : "</span>))
<span style="font-weight: bold;">print</span>(<span style="font-style: italic;">"Tu es n&#233; en %s !"</span> % (2022 - age))
</pre>
</div>

<p>
Pour le moment, cela suffira pour créer des programmes plus intéractifs, mais nous reverrons plus en détail les conversions en python dans le chapitre 4.
</p>
</div>
</div>
