content/index.org
*** Exercices
1. Dans un programme nommé =carte_identite.py= :
   - Pour chaque information à demander à l'utilisateur, il faudra utiliser =input()= avec une question appropriée.
   - Récupère dans une variable =prenom= le prénom de l'utilisateur.
   - Récupère dans une variable =nom= le nom de l'utilisateur.
   - Récupère dans une variable =age= l'âge de l'utilisateur.
   - Récupère dans une variable =taille= la taille de l'utilisateur.
   - Récupère dans une variable =nationalite= la nationalité de l'utilisateur.
   - Affiche *"Je m'appelle <prenom> <nom>, j'ai <age> ans, je fais <taille>cm et mon pays d'origine est <nationalite>."*
* Chapitre 3 : Turtle
:PROPERTIES:
:custom_id: chapitre3
:END:
* Chapitre 4 : Les conditions
:PROPERTIES:
:custom_id: chapitre4
:END:
* Chapitre 5 : Les boucles
:PROPERTIES:
:custom_id: chapitre5
:END:
* Chapitre 6 : Mise en pratique
:PROPERTIES:
:custom_id: chapitre6
:END:
* Chapitre 7 : Les fonctions
:PROPERTIES:
:custom_id: chapitre7
:END:
* Chapitre 8 : Regroupons tout !
:PROPERTIES:
:custom_id: chapitre8
:END:
