public/index.html
<div id="outline-container-orga18e665" class="outline-4">
<h4 id="orga18e665">Exercices</h4>
<div class="outline-text-4" id="text-orga18e665">
<ol class="org-ol">
<li>Dans un programme nommé <code>carte_identite.py</code> :
<ul class="org-ul">
<li>Pour chaque information à demander à l'utilisateur, il faudra utiliser <code>input()</code> avec une question appropriée.</li>
<li>Récupère dans une variable <code>prenom</code> le prénom de l'utilisateur.</li>
<li>Récupère dans une variable <code>nom</code> le nom de l'utilisateur.</li>
<li>Récupère dans une variable <code>age</code> l'âge de l'utilisateur.</li>
<li>Récupère dans une variable <code>taille</code> la taille de l'utilisateur.</li>
<li>Récupère dans une variable <code>nationalite</code> la nationalité de l'utilisateur.</li>
<li>Affiche <b>"Je m'appelle &lt;prenom&gt; &lt;nom&gt;, j'ai &lt;age&gt; ans, je fais &lt;taille&gt;cm et mon pays d'origine est &lt;nationalite&gt;."</b></li>
</ul></li>
</ol>
</div>
</div>
</div>
</div>
<div id="outline-container-chapitre3" class="outline-2">
<h2 id="chapitre3">Chapitre 3 : Turtle</h2>
<div class="outline-text-2" id="text-chapitre3">
</div>
</div>
<div id="outline-container-chapitre4" class="outline-2">
<h2 id="chapitre4">Chapitre 4 : Les conditions</h2>
<div class="outline-text-2" id="text-chapitre4">
</div>
</div>
<div id="outline-container-chapitre5" class="outline-2">
<h2 id="chapitre5">Chapitre 5 : Les boucles</h2>
<div class="outline-text-2" id="text-chapitre5">
</div>
</div>
<div id="outline-container-chapitre6" class="outline-2">
<h2 id="chapitre6">Chapitre 6 : Mise en pratique</h2>
<div class="outline-text-2" id="text-chapitre6">
</div>
</div>
<div id="outline-container-chapitre7" class="outline-2">
<h2 id="chapitre7">Chapitre 7 : Les fonctions</h2>
<div class="outline-text-2" id="text-chapitre7">
</div>
</div>
<div id="outline-container-chapitre8" class="outline-2">
<h2 id="chapitre8">Chapitre 8 : Regroupons tout !</h2>
<div class="outline-text-2" id="text-chapitre8">
</div>
</div>
</div>
</body>
</html>
